/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   cost.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ybalkan <ybalkan@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2026/03/15 15:08:36 by ybalkan           #+#    #+#             */
/*   Updated: 2026/03/15 15:08:37 by ybalkan          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "algo.h"

void	calculate_costs(t_node *a, t_node *b)
{
	/* En ucuz hamleyi bulmak için maliyet hesabı */
}
